---
type: StructuralSectionAnalysisParams
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 19
tags: [revit-api, class]
---

# StructuralSectionAnalysisParams

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams` · Revit 2024 · 19 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionAnalysisParams | — | `` |
| Constructor | StructuralSectionAnalysisParams | 2018 | `public StructuralSectionAnalysisParams ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | ElasticModulusStrongAxis | 2018 | `public double ElasticModulusStrongAxis { get ; set ; }` |
| Property | ElasticModulusWeakAxis | 2018 | `public double ElasticModulusWeakAxis { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | MomentOfInertiaStrongAxis | 2018 | `public double MomentOfInertiaStrongAxis { get ; set ; }` |
| Property | MomentOfInertiaWeakAxis | 2018 | `public double MomentOfInertiaWeakAxis { get ; set ; }` |
| Property | NominalWeight | 2018 | `public double NominalWeight { get ; set ; }` |
| Property | Perimeter | 2018 | `public double Perimeter { get ; set ; }` |
| Property | PlasticModulusStrongAxis | 2018 | `public double PlasticModulusStrongAxis { get ; set ; }` |
| Property | PlasticModulusWeakAxis | 2018 | `public double PlasticModulusWeakAxis { get ; set ; }` |
| Property | PrincipalAxesAngle | 2018 | `public double PrincipalAxesAngle { get ; set ; }` |
| Property | SectionArea | 2018 | `public double SectionArea { get ; set ; }` |
| Property | ShearAreaStrongAxis | 2018 | `public double ShearAreaStrongAxis { get ; set ; }` |
| Property | ShearAreaWeakAxis | 2018 | `public double ShearAreaWeakAxis { get ; set ; }` |
| Property | TorsionalModulus | 2018 | `public double TorsionalModulus { get ; set ; }` |
| Property | TorsionalMomentOfInertia | 2018 | `public double TorsionalMomentOfInertia { get ; set ; }` |
| Property | WarpingConstant | 2018 | `public double WarpingConstant { get ; set ; }` |